{
  "intents": [
    {
      "tag": "first_layer_adhesion",
      "patterns": [
        "The print is not sticking to the bed.",
        "The print is lifting off the bed.",
        "Plastic keeps separating from the plate near the front end",
        "The plastic does not stick to the bed",
        "The filament stopped sticking to the bed out of nowhere",
        "The filament just comes right off the bed and messes up the whole print",
        "Prints not sticking",
        "I can not get the extruded filament to adhere to the build plate",
        "ABS pools up on the extruder and does not stick to the bed",
        "Tip dragging after 10-15 layers",
        "Have problems not sticking",
        "It has been nothing but a nightmare to get these prints unstuck from the bed",
        "Nothing seems to stick to the PVA",
        "The material not sticking to the bed",
        "Left side of the printbed is less sticky than the right",
        "Problems with the ABS layers sticking together",
        "First layers had issues sticking to the bed",
        "Can't get larger ABS prints to adhere to the bed",
        "No layer adhesion on Ender 3 Pro",
        "I'm having a terrible time getting things to stay stuck to the glass"
      ],
      "responses": [
        "Check your bed level. Does that fix the problem?",
        "Check if you are using the appropriate bed temperature. Does that fix the problem?",
        "Try to lower the print speed. Does that fix the problem?",
        "Set a lower fan speed for the first few layers. Does that fix the problem?",
        "Try lowering the nozzle height. Does that fix the problem?",
        "Use an external adhesive agent. Does that fix the problem?",
        "Use bed adhesion tools like brim or raft. Does that fix the problem?"
      ]
    },
    {
      "tag": "nozzle_not_extruding",
      "patterns": [
        "Nothing is coming out of the nozzle",
        "The plastic is not feeding into the nozzle",
        "The filament does not come out of the nozzle",
        "None of the filament gets goes to the bed it all bunches up on the head of the extruder",
        "Clogged nozzles",
        "Plastic is squishing around the edge",
        "My plastic is not extruding properly, it's all stringy and weak, with little bits in it, or air bubbles popping",
        "During long prints the filament sort of jams itself",
        "Now, the first issue that got to me when trying Flexible filament was the extruder. It would not feed.",
        "My original extruders had issues with the nozzles",
        "So how do I correct the over extrusion?",
        "The right nozzle just balls all up around the nozzle and never lays down on the glass bed",
        "The material gathering on the nozzle rather than sticking",
        "Lumpy extrusion or clogged nozzles",
        "It comes out of the extruder in this weird corkscrew pattern",
        "Extruder not working",
        "Weird filament clog",
        "What to do when your 3D Printer nozzle keeps clogging",
        "Ended up clogging up the nozzle"
      ],
      "responses": [
        "Check that the nozzle is not clogged. Does that fix the problem?",
        "Ensure that the nozzle is primed with filament. Does that fix the problem?",
        "Check that the E-motor is working. If it is not working, reconnect the cables of the E-motor. Does that fix the problem?",
        "Ensure that nozzle is not too close to print bed. Does that fix the problem?",
        "Is the filament damaged? You may need to replace the filament. Does that fix the problem?"
      ]
    },
    {
      "tag": "weak_infill",
      "patterns": [
        "Print is very weak and not sturdy",
        "Irregular lines and banding in infill",
        "Material builds up and swells more an more with each layer",
        "Overextruding",
        "Underextruded adjacent lines won't stick to each other",
        "Uneven pattern in the infill",
        "The infill pattern is irregular and messy",
        "There is not enough being extruded for the infill",
        "The part is not strong enough",
        "The infill does not stiffen the part enough",
        "The quality of infill is very bad",
        "Bad infill",
        "The infill was very shotty",
        "My infill is not solid",
        "These globs are right where the infill and outer shell meets at",
        "The infill does not support the outer shell enough",
        "Broken infill",
        "That print has basically has no stiffness and is easily broken",
        "Weirdness in the infill",
        "What the splodge of plastic is doing in the midst of the infill",
        "Infill failure when printing larger prints. However, now that I'm trying some bigger prints and I'm running into infill material excess."
      ],
      "responses": [
        "Increase the print speed of the infill. Does that fix the problem?",
        "Check the extrusion width, increasing it will increase strength. Does that fix the problem?",
        "Use an appropriate infill pattern. Does that fix the problem?"
      ]
    },
    {
      "tag": "stringing_or_oozing",
      "patterns": [
        "Lots and lots of 'spills' and thin strands of material that gets dragged behind the extruder as it moves",
        "Prints are hairy and connected to each other",
        "Many whiskers on my prints",
        "How do I stop stringing",
        "Filament dripping out of nozzle when moving to another location",
        "Printing where theres not supposed to be filament",
        "The filament keeps coming out of the nozzle when its not supposed to",
        "The nozzle pulls filament back too much",
        "There are many strings and whiskers on my print",
        "The nozzle keeps dripping filament when moving to new position",
        "Leaky hot end",
        "This mess happened",
        "I get this strange stringing pattern on my first layer",
        "Leaks at the point where the barrel meets the heat block",
        "Nozzle \"leaks\" when moving between multiple pieces on single layer + calib",
        "Got constant oozing",
        "Terrible time with stringing",
        "Stringing after installing new hotend",
        "I get stringing at the same settings",
        "But suddenly started getting stringing with that and then really messy stringing"
      ],
      "responses": [
        "Check the retraction speed, increasing it can decrease oozing. Does that fix the problem?",
        "Set an ideal retraction distance. Does that fix the problem?",
        "Adjust the heater temperature - lower temperatures reduce oozing. Does that fix the problem?",
        "Avoid long free travels - use settings to find shortest route to the next deposition point. Does that fix the problem?",
        "Adjust travel speed - try a higher travel speed. Does that fix the problem?"
      ]
    },
    {
      "tag": "warping",
      "patterns": [
        "My print curves off the bed",
        "Cube has multiple cracks and a big one at the same height as the torso has",
        "My raft is coming out in a weird curly pattern and not straight?",
        "Prints straight but curves when cooled",
        "Prints change shape when cooled",
        "Corners of print lift off from bed",
        "My print is warping and bending",
        "My prints keep lifting up off the heatbed during print and warping the edges!",
        "Area the supports are in show an uneven area with holes and lumps",
        "Parts curling/warping a few minutes into build",
        "Straight parts are bending and not cooling straight",
        "The corners do not remain straight",
        "The corners keep warping upwards",
        "I started getting severe warping on every print",
        "Too much warping when print cools",
        "I'm trying to print a large piece with polycarbonate but it keeps warping,",
        "3D prints keep suffering from warping",
        "Why has my 3D print warped?",
        "Later on the part begins to curl and deform",
        "I have a warping problem",
        "Why are my layers messy and curling off the print bed?"
      ],
      "responses": [
        "Increase the bed temperature. Does that fix the problem?",
        "Adjust the fan speed - switch off the fan or keep to minimum for first few layers. Does that fix the problem?",
        "Set an optimum ambient temperature if possible. Does that help?",
        "Use bed adhesion tools like Brim and Raft. Does that fix the problem?"
      ]
    },
    {
      "tag": "cannot_print_from_storage_device",
      "patterns": [
        "I tried slicing the model multiple times, different hotness nozzle, 200 micron, 100 micron etc. etc. all the same result.",
        "It looks like there's something wrong with the export or the reading of the file from USB.",
        "Then the printer will just pause like it is getting no comms for a bit",
        "Stops for a while again",
        "It will continue to go until the \"buffer\" apparently is empty, even removing the USB causes it to continue for a while",
        "USB/print failure",
        "Why I can't print anything",
        "I cannot find the file from the SD card",
        "I cannot find the file from the USB drive",
        "I cannot print from the file in the SD card",
        "I cannot print from the file in the USB drive",
        "Issues with calibration and printer hardware/software issues",
        "I wanted S3D to Print the item (I have not waited to see if it will actually print - don't want to print from computer) and the file never uploads to the SD card",
        "Why is my printer not reading my SD card?",
        "How to use a 3D printer",
        "Possible SD card issue",
        "Ender 3 SD card slot not working",
        "Why is my SD card not being recognized?",
        "The machine only seems to have an ability to print from an SD card. Even though a USB cable was provided and has a port on the control box.",
        "My files don't show up when I insert the SD card",
        "How can I print directly from cura to my 3D printer using USB?"
      ],
      "responses": [
        "Try erasing, reformatting or replacing your SD card. Does that fix the problem?",
        "Do other files on your storage device work? If they do, try moving the model and restarting the slicing, or restoring the model. If not, you might have to contact the supplier. Does that fix the problem?"
      ]
    },
    {
      "tag": "print_nozzle_does_not_home",
      "patterns": [
        "The nozzle does not go back to origin",
        "When I press home it does not return",
        "The nozzle does not reset before printing",
        "Cannot go to home position",
        "Nozzle is in the wrong position when I press home",
        "Print head does not go to home position",
        "Print head home position is wrong",
        "Print head ignores home position and keeps going",
        "The print head does not start from home",
        "Print head homing doesn't work",
        "Print head does not return to original position",
        "z-axis zero/home position is higher than the actual print starting position",
        "BLTouch calibrated, nozzle still dives into the bed",
        "Homing still not working",
        "The x-axis forgets its home location",
        "How do I reset this?",
        "Nozzle homes off the bed in the Y axis",
        "I noticed that when you \"auto home\" the print head, the nozzle stops off the front of the print bed by 5-10mm",
        "However, when homing, only the Y axis homes correctly",
        "How do I re-zero the z-axis?",
        "I go about leveling as the manufacturer states by homing all and then using a piece of paper (just dragging a hair) it is way off and layers don't adhere",
        "Nozzle always randomly moves to 0 during print, then resumes",
        "Printer randomly moves to home during printing, then resumes as normal",
        "Not taking the Home Offset into account when printing a test pattern"
      ],
      "responses": [
        "Does it move? If it doesn't, try reconnecting the cables of the XYZ motor. Does that fix the problem?",
        "Try reconnecting the cables of the limit switch. Does that fix the problem?"
      ]
    },
    {
      "tag": "heat_bed_problems",
      "patterns": [
          "The heat bed is not reaching correct temperature",
          "The heat bed is too hot",
          "The heat bed is hotter than the temperature set",
          "Heat bed too cold",
          "The heat bed is not getting hot enough",
          "the heat bed is not heating",
          "I can't get the heat bed temperature to go up",
          "Every time I try to heat the bed, it stops at a random point but always before my set temperature.",
          "Temp is way too high",
          "The bed temperature keeps rising",
          "The heat bed doesn't stay at a constant temperature",
          "The heat bed temperature keeps dropping",
          "It doesn't heat the print bed",
          "Heated bed is not heating anymore",
          "Heat bed wires get hot",
          "It's not heating at all and showing following error. Heating Failed Printer Halted Please Reset",
          "Bed heating from Pronterface works, but not from LCD menu nor from SD print",
          "Heatbed temperature not constant",
          "My heated bed has stopped working"
      ],
      "responses": [
        "Please check if the bed is heated. If not, please reconnect the cables of the heat bed. Does it work now?",
        "Please check if the temperature is at the target temperature. If not, please reconnect the cables of the thermistor. Does it work now?"
      ]
    },
    {
      "tag": "nozzle_heat_problems",
      "patterns": [
        "The nozzle is not hot",
        "The nozzle is hotter than its supposed to be",
        "I can't get the nozzle to heat.",
        "I can't get the extruder temperature to go up",
        "Extruder not heating",
        "I can't get the extruder temperature to go up",
        "Nozzle(s)/hot end not heating up",
        "What to do if nozzle isn't heating",
        "Nozzle cannot be heated up till the desired temp",
        "Every time I try to heat the hotend, the temperature goes up bet stops before set point",
        "Can't heat the nozzle up",
        "Extruder is not heating up to set temperature",
        "Extruder never reaches target temperature",
        "Extruder doesn't heat up by itself.",
        "Heating element gets too hot but nozzle doesn't get hot enough",
        "The actual extruder temperature is much higher than the target extruder temperature",
        "Nozzle heats while autoleveling (or before)",
        "Nozzle heats up past the setpoint and increases",
        "3D Printer hotend won't heat up",
        "My hotend is not warming up"
      ],
      "responses": [
        "Please check if the nozzle is heated. If not, please reconnect the cables of the extruder. Does it work now?",
        "Please check if the temperature is at the target temperature. If not, please reconnect the cables of the thermistor. Does it work now?"
      ]
    },
    {
      "tag": "print_is_misaligned",
      "patterns": [
        "My prints are perfect at the start, but after a few layers they start going messy.",
        "When I first started printing it seemed a bit weird",
        "Lately, I'm having some Print quality issues.",
        "I just can't seem to get a print without some type of blob, defect, etc.",
        "I am getting failed prints, strings, blobs, etc.","the horrible surface blobs on the above print are also unacceptable",
        "Sagging a little",
        "The printer makes an offset for every layer printed",
        "The first layers are fine but after a while the print goes off-centre",
        "What can cause a sudden and dramatic loss in the inter-layer registration of my prints?",
        "Suddenly, the prints have become much worse and the layers are misaligned with respect to each other.",
        "The walls become rough as if the alignment is off or something",
        "While printing a simple model, my printer starts to layer-shift the build in a direction suddenly.",
        "Step skipping and layer shifting",
        "Developed a problem of skipping Y steps (layer shift in the Y direction)",
        "Why am I getting Z banding/shifted layer on a single layer? I noticed that one layer is shifted slightly. Also, that is the only layer that is shifted, every other layer is perfect/almost perfect",
        "I'm having a problem getting a clean first layer on an Ender 3 with BLTouch auto bed leveling. Thickness seems to fluctuate all over the bed, but in a consistent (repeatable) way",
        "What could be causing my y axis to slip? Occasionally, while printing, my y axis will slip and the layer will, from that point forward, be shifted, ruining the print",
        "Perplexing Y-axis shifting problem - only in positive y direction, and only on moves of a very specific radius"
      ],
      "responses": [
        "Try to restart the slicing. Does it work?",
        "Adjust the tension of the synchronous belt. Does it work?"
      ]
    },
    {
      "tag": "others",
      "patterns": [
        "Spindle in the back stops moving",
        "My printer is so SLOW!!! do I have to print at 40ms feed rate?",
        "My print failed and looks charred",
        "What is this weird support line doing in this print?",
        "As soon as it started the second layer the extruder gear starting making a clicking noise like it was slipping and the filament wasn't being extruded any further"
      ],
      "responses": [""]
    }
  ]
}